<?php


return array(
    // 'faculty' => [
    'คณะเกษตร' => array(
        'ภาควิชากีฏวิทยา',
        'ภาควิชาเกษตรกลวิธาน',
        'ภาควิชาคหกรรมศาสตร์',
        'ภาควิชาปฐพีวิทยา',
        'ภาควิชาพืชไร่นา',
        'ภาควิชาพืชสวน',
        'ภาควิชาโรคพืช',
        'ภาควิชาส่งเสริมและนิเทศศาสตร์เกษตร',
        'ภาควิชาสัตวบาล',
        'ศูนย์วิจัยข้าวโพดและข้าวฟ่างแห่งชาติ',
        'ศูนย์วิจัยและถ่ายทอดเทคโนโลยีการเกษตร',
        'โครงการหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเกษตรเขตร้อน (หลักสูตรนานาชาติ) ภาคพิเศษ',
        'โครงการเปิดสอนระดับปริญญาโท สาขาการสื่อสารเพื่อการพัฒนา (หลักสูตรนานาชาติ) ภาคพิเศษ',
        'โครงการหลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาเกษตรเขตร้อน ภาคพิเศษ-หลักสูตรนานาชาติ',
        'โครงการปริญญาโทส่งเสริมการเกษตรสำหรับผู้บริหาร (ภาคพิเศษ)',
        'โครงการหลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาคหกรรมศาสตร์ (ภาคพิเศษ)',
        'โครงการหลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเกษตรเขตร้อน (ภาคพิเศษ)-หลักสูตรไทย',
        'โครงการหลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเกษตรยั่งยืน (หลักสูตรนานาชาติ)',
        'โครงการหลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาพลังงานชีวภาพ (ภาคพิเศษ)',
        'โครงการหลักสูตรวิทยาศาสตรดุษฎีบัณฑิต สาขาเกษตรเขตร้อน ภาคพิเศษ -หลักสูตรนานาชาติ',
        'โครงการหลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาเกษตรเขตร้อน ภาคพิเศษ -หลักสูตรไทย',
    ),
    'คณะบริหารธุรกิจ' => array(
        'ภาควิชาการเงิน',
        'ภาควิชาการจัดการ',
        'ภาควิชาการจัดการการผลิต',
        'ภาควิชาการตลาด',
        'ภาควิชาบัญชี',
    ),
    'คณะประมง' => array(
        'ภาควิชาการจัดการประมง',
        'ภาควิชาชีววิทยาประมง',
        'ภาควิชาผลิตภัณฑ์ประมง',
        'ภาควิชาเพาะเลี้ยงสัตว์น้ำ',
        'ภาควิชาวิทยาศาสตร์ทางทะเล',
    ),
    'คณะมนุษยศาสตร์' => array(
        'ภาควิชาดนตรี',
        'ภาควิชานิเทศศาสตร์และสารสนเทศศาสตร์',
        'ภาควิชาภาษาต่างประเทศ',
        'ภาควิชาวรรณคดี',
        'ภาควิชาภาษาศาสตร์',
        'ภาควิชาภาษาไทย',
        'ภาควิชาภาษาตะวันออก',
        'ภาควิชาปรัชญาและศาสนา',
        'ภาควิชาอุตสาหกรรมท่องเที่ยวและบริการ'
    ),
    'คณะวนศาสตร์' => array(
        'ภาควิชาการจัดการป่าไม้',
        'ภาควิชาชีววิทยาป่าไม้',
        'ภาควิชาวิศวกรรมป่าไม้',
        'ภาควิชาวนผลิตภัณฑ์',
        'ภาควิชาวนวัฒนวิทยา',
        'ภาควิชาอนุรักษวิทยา',
    ),
    'คณะวิทยาศาสตร์' => array(
        'ภาควิชาคณิตศาสตร์',
        'ภาควิชาเคมี',
        'ภาควิชาจุลชีววิทยา',
        'ภาควิชาชีวเคมี',
        'ภาควิชาพฤกษศาสตร์',
        'ภาควิชาพันธุศาสตร์',
        'ภาควิชาฟิสิกส์',
        'ภาควิชารังสีประยุกต์และไอโซโทป',
        'ภาควิชาวิทยาการคอมพิวเตอร์',
        'ภาควิชาวิทยาศาสตร์พื้นพิภพ',
        'ภาควิชาวัสดุศาสตร์',
        'ภาควิชาสถิติ',
        'ภาควิชาสัตววิทยา',
    ),

    'คณะวิศวกรรมศาสตร์' => array(
        'ภาควิชาวิศวกรรมการบินและอวกาศ',
        'ภาควิชาวิศวกรรมคอมพิวเตอร์',
        'ภาควิชาวิศวกรรมเคมี',
        'ภาควิชาวิศวกรรมเครื่องกล',
        'ภาควิชาวิศวกรรมทรัพยากรน้ำ',
        'ภาควิชาวิศวกรรมไฟฟ้า',
        'ภาควิชาวิศวกรรมวัสดุ',
        'ภาควิชาวิศวกรรมโยธา',
        'ภาควิชาวิศวกรรมสิ่งแวดล้อม',
        'ภาควิชาวิศวกรรมอุตสาหการ',
    ),

    'คณะศึกษาศาสตร์' => array(
        'ภาควิชาการศึกษา',
        'ภาควิชาจิตวิทยาการศึกษาและการแนะแนว',
        'ภาควิชาเทคโนโลยีการศึกษา',
        'ภาควิชาพลศึกษา',
        'ภาควิชาอาชีวศึกษา',
    ),

    'คณะเศรษฐศาสตร์' => array(
        'ภาควิชาเศรษฐศาสตร์',
        'ภาควิชาเศรษฐศาสตร์เกษตรและทรัพยากร',
        'ภาควิชาสหกรณ์',
    ),
    'คณะสถาปัตยกรรมศาสตร์' => array(
        'ภาควิชาสถาปัตยกรรม',
        'ภาควิชาภูมิสถาปัตยกรรม',
        'ภาควิชานวัตกรรมอาคาร'
    )

    // ]    

);
